devops-resume.tex
% Created 2015-08-30 Sun 13:35
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[scaled]{helvet}
\renewcommand*\familydefault{\sfdefault}
\author{Oleg Sivokon}
\date{\textit{<2015-08-30 Sun>}}
\title{Resume}
\hypersetup{
 pdfauthor={Oleg Sivokon},
 pdftitle={Resume},
 pdfkeywords={Resume, job, employment, cv},
 pdfsubject={My resume},
 pdfcreator={Emacs 25.0.50.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Contact Information}
\label{sec:orgheadline1}
\begin{center}
\begin{tabular}{ll}
Name: & Oleg Sivokon\\
Birth date: & 23, 06, 1978\\
Cell phone: & +972 (0) 544-563314\\
Email: & \href{mailto:olegsivokon@gmail.com}{olegsivokon@gmail.com}\\
Address: & Florentin 50, Tel Aviv, Israel\\
\end{tabular}
\end{center}

\emph{You can find an up-to-date electronic copy of this document at}

\url{https://github.com/wvxvw/resume}

\clearpage

\section{Technology Summary}
\label{sec:orgheadline8}
\subsection{Languages}
\label{sec:orgheadline2}
ActionScript, C, Clojure, Common Lisp, Emacs Lisp, Erlang, Forth, Haskell,
Haxe, Java, JavaScript, Mercury, OCaml, PHP, Prolog, Python, Ruby, Scala,
Scheme, Shell.

\subsection{Mathematics And Statistics}
\label{sec:orgheadline3}
J, Julia, Maxima, Octave (Matlab), R (S).

\subsection{Related Technologies}
\label{sec:orgheadline4}
Data representation formats (XML, YAML, JSON, RDF, AMF), Graph databases,
Network protocols (TCP, UDP, HTTP, FTP), Relational databases (SQL), Web
stack (HTML, CSS).

\subsection{Programming Environments}
\label{sec:orgheadline5}
Eclipse, Emacs, Intellij IDEA, Vim, Visual Studio.

\subsection{Operating Systems}
\label{sec:orgheadline6}
Android, GNU/Linux, Mac OS, Microsoft Windows.

\subsection{Infrastructure}
\label{sec:orgheadline7}
Ant, Maven, Gradle, Make, Grunt, Jenkins, JIRA, Redmine, Track, Mediawiki,
Bugzilla, Selenium, Flex Unit, JUnit, unittest (Python), 5am, Cucumber, Git,
Subversion, Mercurial, Perforce, Bazaar.

\clearpage

\section{Work History}
\label{sec:orgheadline12}

\subsection{PowToon Ltd.}
\label{sec:orgheadline9}
\begin{description}
\item[{Position}] \emph{Programmer} / \emph{ops}
\item[{Term}] \emph{January 2014--May 2015}
\item \textbf{Accomplishments}
\begin{itemize}
\item I set up and maintained Jenkins continuous integration server in
an AWS box.  Maintainance included writing non-trivial configuration
files, patching plug-ins (the mailer plugin), and one major version
upgrade.
\item I wrote most of the infrastructure code s.a. build scripts, automated
test generation and simplistic statistical analysis.  This included
Ant build scripts for the ActionScript part of the project.  Gradle
scripts for managing back-office resources.  Python (Fabric) scripts
for deployment of the server-side and some statistics extraction
from the customers database (NumPy, SciPy), although the later was
more of an experiment.
\item I wrote several designs for the product.
\end{itemize}
\end{description}

\subsection{TransGaming Inc.}
\label{sec:orgheadline10}
\begin{description}
\item[{Position}] \emph{Programmer} / \emph{ops}
\item[{Term}] \emph{April 2013--2013 (less than a year)}
\item \textbf{Accomplishments}
\begin{itemize}
\item I wrote a tester program, which stress-tested the program performance
on ``Smart TV''.
\item I wrote automated build for my project.
\item I wrote a sizable chunk of code dealing with usage statistic aggregation
using Google Analytics.
\item I did a good deal of administrative work on company's Git repository.
This included working with history, cleaning the repository up, exporting
reports, managing users' permissions, writing hooks.
\end{itemize}
\end{description}

\subsection{Rounds}
\label{sec:orgheadline11}
\begin{description}
\item[{Position}] \emph{Programmer}
\item[{Term}] \emph{December 2010 – August 2011 (9 months)}
\item \textbf{Accomplishments}
\begin{itemize}
\item I wrote a testing server and utility programs for automated testing.
\item I wrote a small natural language processing program which was used
to advertise the company's product.
\item For a short while I managed company's bug tracking system (Trac),
later replaced by Redmine, and then outsourced.
\end{itemize}
\end{description}

\section{Courses}
\label{sec:orgheadline13}
\begin{itemize}
\item I am a second year student in Open University of Israel, facutly of
Mathematics.
\item I also took some on-line courses, s.a. Data Scientists Toolbox, Statistics,
Data Analysis, Machine Learning. at Coursera and edX.
\end{itemize}

\section{Books}
\label{sec:orgheadline14}
This section lists some books, which, in my view, may help explain what kind
of knowledge I have in relevant fields.

\begin{description}
\item[{agile programming}] Extreme Programming Explained by Kent Beck.
\item[{software architecture}] Patterns of Enterprise Application Architecture by
Martin Fowler.
\item[{development and operations}] Pro Puppet by Spencer Krum, William Van
Hevelingen, Ben Kero, James Turnbull, Jeffrey McCune.
\item[{general computer science}] SICP, AITMA, TAOCP.  Less commonplace ones:
Types and Programming Languages by B. C. Pierce, Homotopy Type Theory:
Univalent Foundations of Mathematics, A Structural Approach to
Operational Semantics by G. D. Plotkin--just to give you a sense of what
I'm interested in.
\item I regularly read CS periodicals, attend on-line lectures and listen to
podcasts with particular interest in AI and computational linguistics.
\end{description}

\section{Volunteering And Community Work}
\label{sec:orgheadline15}
SCons project, ActionScript plugin.  (SCons is an extensible build system
written in Python).

For several years I was a member of Adobe Community Board.  I moderated a
forum dedicated to Flash and ActionScript.

I'm an active member of Emacs Q/A site from the StackExchange family.

\section{Examples Of My Work}
\label{sec:orgheadline16}
My Github profile:
\url{https://github.com/wvxvw/}.

\section{Hobbies}
\label{sec:orgheadline17}
\begin{itemize}
\item NLP
\item Computational linguistics
\item Moral philosophy
\item General AI
\item Graphs
\end{itemize}
\end{document}